Revit 2026 API

# SubelementCreate Method

---

Creates an object representing element or subelement.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Subelement Create(
	Document aDoc,
	Reference reference
)
```
```vb
Public Shared Function Create (
	aDoc As Document,
	reference As Reference
) As Subelement
```
```cpp
public:
static Subelement^ Create(
	Document^ aDoc,
	Reference^ reference
)
```
```fsharp
static member Create :
        aDoc : Document *
        reference : Reference -> Subelement
```

#### Parameters

aDoc Document
     The document.
reference Reference
     The reference that identifies element or subelement.

#### Return Value

Subelement The newly created subelement.

| Exception | Condition |
| --- | --- |
| ArgumentException | reference does not identify a valid element or subelement. |
| ArgumentNullException | A non-optional argument was null |

If %reference% points to linked document:

  * The GetReference method of the newly created subelement will return the local reference in the linked document.
  * The Document property of the newly created subelement will return the linked document.

#### Reference

Subelement Class

Autodesk.Revit.DB Namespace